//#include <iostream>
//using namespace std;
//int main() {
//	setlocale(0, "");
	//double a, b, c, d, e, f, g, h;
	//cout << "--- 1-ый работник ---"<<endl;
	//cout << "¬ведите количество отработанных часов ";
	//cin >> a;
	//cout << "¬ведите ставку почасовой оплаты ";
	//cin >> b;
	//cout << "¬ведите % премии ";
	//cin >> c;

	//g = a * b * (1 + c / 100);

	//cout <<endl<< "--- 2-ой работник ---"<<endl;
	//cout << "¬ведите количество отработанных часов ";
	//cin >> d;
	//cout << "¬ведите ставку почасовой оплаты ";
	//cin >> e;
	//cout << "¬ведите % премии ";
	//cin >> f;
//
//	h = d * e * (1 + f / 100);
//
//	if (g > h)
//		cout <<endl<< "1-ый заработал больше";
//	else
//		cout <<endl<< "2-ой заработал больше";
//
//	cout <<endl<<"ќбща€ сумма " << g + h<<" рублей";
//	return 0;
//}